package com.aslanbolurov.kinza.kinzarestolovaya.data.dishesDataSource

import com.aslanbolurov.kinza.kinzarestolovaya.data.dishesDataSource.dto.DishesDto
import com.squareup.moshi.Moshi
import javax.inject.Inject

class DataSource @Inject constructor() {

    fun getJsonDishes() = """
         {
         "Mon":{
            "dishes":[
                {"name":"Суп Лапша","price":"70"},
                {"name":"Лагман","price":"125"},
                {"name":"Суп чечевичный","price":"85"},
                {"name":"Окрошка","price":"125"},
                {"name":"Том ям с курицей","price":"120"},
                {"name":"Куринные шарики с сыром","price":"95"},
                {"name":"Котлета куринная","price":"90"},
                {"name":"Котлета по-киевски","price":"95"},
                {"name":"Макароны с сёмгой","price":"155"},
                {"name":"Куриное филе под шубой","price":"135"},
                {"name":"Филе курицы отварное","price":"90"},
                {"name":"Куринная грудка с начинкой","price":"175"},
                {"name":"Варенники с картошкой","price":"120"},
                {"name":"Манты","price":"160"},
                {"name":"ПП-котлета куринная","price":"110"},
                {"name":"Говядина отварная","price":"120"},
                {"name":"Печень куринная с грибами","price":"145"},
                {"name":"Котлета говяжья","price":"95"},
                {"name":"Плов из говядины","price":"139"},
                {"name":"Курица с овощами","price":"120"},
                {"name":"Мясо с овощами в соусе терияки","price":"165"},
                {"name":"Стейк лосося на гриле","price":"299"},
                {"name":"Говядина с овощами и фунчозой","price":"159"},
                {"name":"Говядина в собственном соку","price":"220"},
                {"name":"Курица по-азиатски","price":"105"},
                {"name":"Окунь жаренный","price":"129"},
                {"name":"Фрикасе из курицы","price":"145"},
                {"name":"Картофель по-деревенски","price":"120"},
                {"name":"Картофельное пюре","price":"60"},
                {"name":"Гречка","price":"45"},
                {"name":"Спагетти","price":"45"},
                {"name":"Овощи на пару","price":"85"},
                {"name":"Рис с овощами","price":"55"},
                {"name":"Кускус","price":"65"}
              ],
            "desserts":[
                {"name":"Медовый","price":"95"},
                {"name":"Наполеон","price":"120"},
                {"name":"Меренговый рулет","price":"120"},
                {"name":"Трайфл банановый","price":"120"},
                {"name":"Молочная девочка","price":"120"},
                {"name":"Шоколадно-банановый торт","price":"160"},
                {"name":"Сан-Себастьян","price":"170"},
                {"name":"Блин без начинки","price":"20"},
                {"name":"Блин с творогом","price":"40"},
                {"name":"Запеканка","price":"67"},
                {"name":"Сгущенка","price":"20"},
                {"name":"Венеция","price":"85"},
                {"name":"Курица под шубой","price":"120"},
                {"name":"Мужской каприз","price":"115"},
                {"name":"Крабовый","price":"75"},
                {"name":"Оливье","price":"95"},
                {"name":"Венегрет","price":"62"},
                {"name":"Капустный с перцем и огурцом","price":"39"},
                {"name":"Корейская морковь","price":"45"},
                {"name":"С редисом и огурцом","price":"60"},
                {"name":"Овощной","price":"65"},
                {"name":"с рукколой","price":"135"},
                {"name":"Греческий","price":"120"}
               ],
            "grill":[
                {"name":"Шашлык из баранины","price":"170"},
                {"name":"Шашлык из бараньих пистолетиков","price":"190"},
                {"name":"Шашлык из курицы","price":"100"},
                {"name":"Люля кебаб","price":"139"},
                {"name":"Мясное ассорти из шашлыков","price":"990"},
                {"name":"Стейк лосося на мангале","price":"299"},
                {"name":"Форель запечённая","price":"200"},
                {"name":"Дорада запечённая","price":"370"},
                {"name":"Сибас запечённый","price":"370"},
                {"name":"Рыбное ассорти из шашлыков","price":"550"},
                {"name":"Ассорти рыб на углях","price":"999"},
                {"name":"Картофель запечённый на мангале","price":"55"},
                {"name":"Овощи на мангале","price":"95"},
                {"name":"Грибы запечённые на мангале","price":"120"},
                {"name":"Овощное ассорти на мангале","price":"380"},
                {"name":"Хачапури по-аджарски","price":"299"},
                {"name":"Хачапури по-мегрельски","price":"449"},
                {"name":"Хычын с сыром и творогом","price":"369"},
                {"name":"Хычын с картофелем и сыром","price":"349"},
                {"name":"Хычын с мясом","price":"479"},
                {"name":"Хычын с ботвой","price":"359"},
                {"name":"Хычын с урицей и сыром","price":"450"},
                {"name":"Хычынчик с сыром и творогом","price":"115"},
                {"name":"Хычынчик с картофелем и сыром","price":"95"},
                {"name":"Хычынчик с мясом","price":"125"},
                {"name":"Хычынчик с ботвой","price":"109"},
                {"name":"Хычынчик с урицей и сыром","price":"109"}
               ],
            "pizza":[
                {"name":"3 сыра 30 см","price":"399"},
                {"name":"Ассорти с курицей/грибами 30 см","price":"409"},
                {"name":"Ассорти с колбасой халяль/грибами 30см","price":"399"},
                {"name":"Пицца Цезарь 30 см","price":"449"},
                {"name":"Пицца Маргарита 30 см","price":"369"},
                {"name":"Пицца Пепперони 30 см","price":"469"}
               ]
            }
        }      
""".trimIndent()


}